import random
import math
#Программа получает на вход последовательность целых неотрицательных чисел, каждое число
#программно генерируется генератором случайных чисел и выводится на экран.
#Если сгенерировано число 0, то программа должна закончить свою работу и вывести сумму всех
#элементов последовательности
#=====================================================
'''
run=True
summa = 0
while run:
    i=random.randint(0,10)
    print(i)
    summa = summa + i
    if i == 0:
        run = False
print('SUM : ',summa)
'''
#=====================================================
#Программа получает на вход последовательность целых неотрицательных чисел, каждое число
#программно генерируется генератором случайных чисел и выводится на экран.
#Если сгенерировано число 0, то программа должна закончить свою работу и вывести значение
#наибольшего элемента последовательности и среднее значение последовательности .
run=True
summa = 0
k=0
m = -5
while run:
    #i = 0
    i = random.randint(0,10)
    print(i)
    if  i != 0:
        k+=1
        summa = summa + i
    else:
        run = False   
    if i > m:
        m = i
if k != 0 :
    print('SUMMA = ',summa)
    medium = summa / k
    print('Среднее арефметическое = ',round(medium,2))
    print('Количество чисел',k)
    print('Максимальное число = ',m)
else:
    print('Вызод из цикла a = 0')


#=====================================================
#=====================================================
#=====================================================
#=====================================================
#=====================================================
#=====================================================
#=====================================================
#=====================================================
#=====================================================
#=====================================================
#=====================================================
