import random
'''
import random
a = random.randint(0,1)
print(a)
a = random.randint(0,1)
print(a)
a = random.randint(0,1)
print(a)

#========================
print('random.randrange(5,25,5')
b = random.randrange(5,25,5)
print(b)
b = random.randrange(5,25,5)
print(b)
b = random.randrange(5,25,5)
print(b)

#========================
print('c = random.random()')
c = random.random()
print(c)
c = random.random()
print(c)
c = random.random()
print(c)

#==========Zada4i==============
#Даны три целых числа. Определите, сколько среди них совпадающих. Программа должна
#вывести одно из чисел: 3 (если все совпадают), 2 (если два совпадает) или 0 (если все числа
#различны)
#a = random.randint(0,20)
#b = random.randint(0,20)
#c = random.randint(0,20)
a = int(input())
b = int(input())
c = int(input())
if a==b==c:
    print(a)
    print(b)
    print(c)
    print('все совпадают')
elif a==b or a==c or b==c :
    print(a)
    print(b)
    print(c)
    print('два совпадает') 
else:
    print(a)
    print(b)
    print(c)
    print('все числа различны')
'''
