#!!!!!!!уровень сложности B!!!!!!!!!
import random
prav = 0
f = True
a = 'умножение', 'деление', 'сложение', 'вычетание'
a1 = 'деление', 'умножение', 'сложение', 'вычетание'
a3 = 'деление', 'умножение', 'вычетание', 'сложение'
a4 = 'вычетание', 'сложение', 'деление', 'умножение'
a5 = 'умножение',' '
a6 = 'деление',' '
a7 = 'сложение',' '
a8 = 'вычетание',' '
print('*******************************************************************')
print('Тема : Применение цыклов')
print('Автор работы: Алексей Крымский')
print('Уровень сложности работы B')
print('*******************************************************************')
print('!!!Данный тест проверит ваши знания и скорость!!!\n В этой программе предоставлены возможности: ')
print(' - Выбор 4ох способов тренеровки \n - Выбор определенной последовательности')
print(' !!!Приятного прохождения теста!!!')
print('*******************************************************************')
print('1 - умножение')
print('2 - деление')
print('3 - сложение')
print('4 - вычитание')
print('5 - выполнить все операции, выбирая последовательно ')
ot = int(input('Выберите функцию = '))
if ot == 1:
    k = a5
elif ot ==2:
    k = a6
elif ot ==3:
    k = a7
elif ot ==4:
    k = a8
elif ot == 5:
    print('1 - умножение', 'деление', 'сложение', 'вычитание')
    print('2 - деление', 'умножение', 'сложение', 'вычитание')
    print('3 - деление', 'умножение', 'вычитание', 'сложение')
    print('4 - вычитание', 'сложение', 'деление', 'умножение')
    otcet = int(input('Выбери цыфру последовательности = '))
    if otcet == 1:
        k = a
    elif otcet == 2:
        k = a1
    elif otcet == 3:
        k = a3
    elif otcet == 4:
        k = a4
    else:
        print('invalid command')

for i in k:
    if i == 'умножение':
        print('=====================умножение==========================')
        for r in range(1,6):
            rand1=random.randint(1,10)
            rand2=random.randint(1,10)
            print(r,'.\t',rand1,'*',rand2,'=',end=" ")
            otvet = int(input())
            if otvet == rand1 * rand2:
                print('молодец')
                prav = prav + 1 #счетчик правильных ответов
            else:
                print('правильный ответ = ',rand1 * rand2)
    elif i == 'деление':
        print('=====================деление==========================')
        for r in range(1,6):
            while f:
                rand1 = random.randint(1,100)
                rand2 = random.randint(1,100)
                if rand1 > rand2:
                    if rand1 % rand2 == 0:
                        print(r,'.\t',rand1,'/',rand2,'=',end=" ")
                        otvet = int(input())
                        if otvet == rand1 / rand2:
                            print('молодец')
                            prav = prav + 1 #счетчик правильных ответов
                            break
                        else:
                            print('правильный ответ = ',rand1 / rand2)
                            break
    elif i == 'сложение':
        print('=====================сложение==========================')
        for r in range(1,6):
            rand1=random.randint(1,50)
            rand2=random.randint(1,50)
            print(r,'.\t',rand1,'+',rand2,'=',end=" ")
            otvet = int(input())
            if otvet == rand1 + rand2:
                print('молодец')
                prav = prav + 1 #счетчик правильных ответов
            else:
                print('правильный ответ = ',rand1 + rand2)
        
    elif i == 'вычетание':
        print('=====================вычитание==========================')
        for r in range(1,6):
            rand1=random.randint(50,100)
            rand2=random.randint(1,50)
            print(r,'.\t',rand1,'-',rand2,'=',end=" ")
            otvet = int(input())
            if otvet == rand1 - rand2:
                print('молодец')
                prav = prav + 1 #счетчик правильных ответов
            else:
                print('правильный ответ = ',rand1 - rand2)
print('===============================================')
if ot == 5:
    print('количество правельных : ',prav,' из 20')
    input()
else:
    print('количество правельных : ',prav,' из 5')
    input()
